import { redirect } from "next/navigation";
import { auth } from "../../../auth";
import styles from "../components/dashboard.module.css";


const DashboardPage = async () => { 

  const session = await auth();

  if (!session?.user) redirect("/");

  return (
    <div>
      <div className={styles.contentPage}>
        <h2>Інтегруй штучний інтелект у всі етапи розробки та досягни нових висот продуктивності</h2>
        <p>Уявіть, що ваші повсякденні завдання з розробки автоматизовані, рутинні процеси значно скорочені, а якість коду підвищена. Це можливо з <strong>DevAI</strong> – системою, що впроваджує штучний інтелект на кожному етапі вашого проекту, від планування до релізу.</p>

        <div className={styles.features}>
          <h3>Переваги DevAI:</h3>
          <ul>
            <li><strong>Автоматизація без обмежень:</strong> автоматизуйте рутинні завдання, такі як написання повторюваних фрагментів коду, створення тестових сценаріїв та аналіз логів.</li>
            <li><strong>Розумний аналіз і оптимізація коду:</strong> AI аналізує код і пропонує рекомендації щодо покращення.</li>
            <li><strong>Автоматичне тестування та налагодження:</strong> автоматизуйте тестування та підвищуйте надійність вашого продукту.</li>
            <li><strong>Гнучка інтеграція:</strong> підтримка різних мов програмування та фреймворків, таких як Next.js, React, Node.js та інші.</li>
          </ul>
        </div>

        <div className={styles.how}>
          <h3>Як це працює?</h3>
          <p><strong>Розробка:</strong> отримайте рекомендації щодо покращення коду в реальному часі за допомогою AI.</p>
          <p><strong>Тестування:</strong> автоматизуйте створення тестів і аналіз коду для виявлення помилок.</p>
          <p><strong>Деплоймент:</strong> оптимізуйте процес деплойменту та забезпечте стабільність вашого продукту.</p>
        </div>
      </div>
    </div>
  );
};

export default DashboardPage;